In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [14]:
names=pd.Series(['Data science','Machine Learning' ,'Natural language processing'], index=[1,2,3])
names

1                   Data science
2               Machine Learning
3    Natural language processing
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [15]:
names.index=[11,12,13]
names

11                   Data science
12               Machine Learning
13    Natural language processing
dtype: object

## Q3: Retrieve First and second elements.

In [16]:
names[:2]

11        Data science
12    Machine Learning
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [22]:
names.loc[20] = 'Data science'
names.drop_duplicates()

11                   Data science
12               Machine Learning
13    Natural language processing
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [25]:
 Student={
     'ID':[2200400015 ,21900300120 ,22140340187] ,
     'Name':['Abdullah','Hamad' ,'Rayan'] ,
     'GPA':[4.25 ,4.1 , 3.9]
 }

Students=pd.DataFrame(Student ,columns=['ID','Name','GPA'])
Students

            ID      Name   GPA
0   2200400015  Abdullah  4.25
1  21900300120     Hamad  4.10
2  22140340187     Rayan  3.90

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [26]:
educ=pd.read_csv('educ_figdp_1_Data.csv')
educ.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

#### loc

In [34]:
educ.loc[9:20]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e
16,2004,European Union (27 countries),Total public expenditure on education as % of ...,4.95,e
17,2005,European Union (27 countries),Total public expenditure on education as % of ...,4.92,e
18,2006,European Union (27 countries),Total public expenditure on education as % of ...,4.91,e
19,2007,European Union (27 countries),Total public expenditure on education as % of ...,4.93,e
20,2008,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e

#### slicing

In [35]:
educ[:10]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e